20220928221257-raspberry_pi.org
:PROPERTIES:
:ID:       e467a776-320f-45e7-bb12-c973de004e9c
:END:
#+title: Raspberry Pi
* 概要
Raspberry PiはARMプロセッサを搭載したシングルボードコンピュータ。趣味や業務のIoT開発に用いられる。

- [[https://ja.wikipedia.org/wiki/Raspberry_Pi][Raspberry Pi - Wikipedia]]
* Memo
** GND
- グランドと読む
- GNDは電位の基準になる点で、電流の到達点になる。
- 電気は水が流れるように電位が高いところから低いところに流れる。最も低い地点が基準で、GND。
- 電源のマイナス極。
- 電位の差が電圧
* Tasks
** TODO [[https://www.kairo-nyumon.com/index.html][電子回路設計の基礎 - わかりやすい！入門サイト]]
:LOGBOOK:
CLOCK: [2022-10-21 Fri 12:53]--[2022-10-21 Fri 13:18] =>  0:25
:END:
電子工作入門。入門のはずが、意味がわからない。数式出てくるとダメだ。
** TODO [[https://www.oreilly.co.jp/books/9784873119991/][O'Reilly Japan - Raspberry Piをはじめよう 第4版]]
:LOGBOOK:
CLOCK: [2022-10-21 Fri 14:24]--[2022-10-21 Fri 14:49] =>  0:25
CLOCK: [2022-10-21 Fri 12:06]--[2022-10-21 Fri 12:31] =>  0:25
CLOCK: [2022-10-20 Thu 18:08]--[2022-10-20 Thu 18:33] =>  0:25
CLOCK: [2022-10-20 Thu 12:50]--[2022-10-20 Thu 13:15] =>  0:25
CLOCK: [2022-09-29 Thu 18:29]--[2022-09-29 Thu 18:54] =>  0:25
CLOCK: [2022-09-29 Thu 17:44]--[2022-09-29 Thu 18:09] =>  0:25
CLOCK: [2022-09-29 Thu 13:42]--[2022-09-29 Thu 14:07] =>  0:25
CLOCK: [2022-09-29 Thu 08:41]--[2022-09-29 Thu 09:06] =>  0:25
CLOCK: [2022-09-29 Thu 00:46]--[2022-09-29 Thu 01:11] =>  0:25
CLOCK: [2022-09-28 Wed 22:47]--[2022-09-28 Wed 23:12] =>  0:25
CLOCK: [2022-09-28 Wed 22:16]--[2022-09-28 Wed 22:41] =>  0:25
:END:

- 111

Raspberry Piの入門。
* Reference
** [[https://deviceplus.jp/mc-general/tidbits-of-electronics-01/][ここが分かると面白くなる！エレクトロニクスの豆知識 第1回：はじめてのトランジスタ | Device Plus - デバプラ]]
トランジスタのわかりやすい説明。
** [[https://burariweb.info/electronic-work/arduino-learning/arduino-lcd-module-display.html][【Arduino入門編⑰】LCDディスプレイに文字を表示させてみる！［前編］[1602 LCDモジュール] | ぶらり＠web走り書き]]
LCDディスプレイを使うチュートリアル。
* Archives
