20220928221257-raspberry_pi.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-10-25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Raspberry Pi</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Raspberry Pi</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgce1cb9a">概要</a></li>
<li><a href="#org5a416c8">Memo</a>
<ul>
<li><a href="#org2eab7d8">GND</a></li>
</ul>
</li>
<li><a href="#org2de42f8">Tasks</a>
<ul>
<li><a href="#orgbb1253d"><span class="todo TODO">TODO</span> 電子回路設計の基礎 - わかりやすい！入門サイト</a></li>
<li><a href="#orgf954113"><span class="todo TODO">TODO</span> O&rsquo;Reilly Japan - Raspberry Piをはじめよう 第4版</a></li>
</ul>
</li>
<li><a href="#orgb6357fa">Reference</a>
<ul>
<li><a href="#org4dfe108">ここが分かると面白くなる！エレクトロニクスの豆知識 第1回：はじめてのトランジスタ | Device Plus - デバプラ</a></li>
<li><a href="#orgf7dc33b">【Arduino入門編⑰】LCDディスプレイに文字を表示させてみる！［前編］[1602 LCDモジュール] | ぶらり＠web走り書き</a></li>
</ul>
</li>
<li><a href="#org0766be0">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgce1cb9a" class="outline-2">
<h2 id="orgce1cb9a"><a href="#orgce1cb9a">概要</a></h2>
<div class="outline-text-2" id="text-orgce1cb9a">
<p>
Raspberry PiはARMプロセッサを搭載したシングルボードコンピュータ。趣味や業務のIoT開発に用いられる。
</p>

<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/Raspberry_Pi">Raspberry Pi - Wikipedia</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5a416c8" class="outline-2">
<h2 id="org5a416c8"><a href="#org5a416c8">Memo</a></h2>
<div class="outline-text-2" id="text-org5a416c8">
</div>
<div id="outline-container-org2eab7d8" class="outline-3">
<h3 id="org2eab7d8"><a href="#org2eab7d8">GND</a></h3>
<div class="outline-text-3" id="text-org2eab7d8">
<ul class="org-ul">
<li>グランドと読む</li>
<li>GNDは電位の基準になる点で、電流の到達点になる。</li>
<li>電気は水が流れるように電位が高いところから低いところに流れる。最も低い地点が基準で、GND。</li>
<li>電源のマイナス極。</li>
<li>電位の差が電圧</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2de42f8" class="outline-2">
<h2 id="org2de42f8"><a href="#org2de42f8">Tasks</a></h2>
<div class="outline-text-2" id="text-org2de42f8">
</div>
<div id="outline-container-orgbb1253d" class="outline-3">
<h3 id="orgbb1253d"><a href="#orgbb1253d"><span class="todo TODO">TODO</span> <a href="https://www.kairo-nyumon.com/index.html">電子回路設計の基礎 - わかりやすい！入門サイト</a></a></h3>
<div class="outline-text-3" id="text-orgbb1253d">
<p>
電子工作入門。入門のはずが、意味がわからない。数式出てくるとダメだ。
</p>
</div>
</div>
<div id="outline-container-orgf954113" class="outline-3">
<h3 id="orgf954113"><a href="#orgf954113"><span class="todo TODO">TODO</span> <a href="https://www.oreilly.co.jp/books/9784873119991/">O&rsquo;Reilly Japan - Raspberry Piをはじめよう 第4版</a></a></h3>
<div class="outline-text-3" id="text-orgf954113">
<ul class="org-ul">
<li>111</li>
</ul>

<p>
Raspberry Piの入門。
</p>
</div>
</div>
</div>
<div id="outline-container-orgb6357fa" class="outline-2">
<h2 id="orgb6357fa"><a href="#orgb6357fa">Reference</a></h2>
<div class="outline-text-2" id="text-orgb6357fa">
</div>
<div id="outline-container-org4dfe108" class="outline-3">
<h3 id="org4dfe108"><a href="#org4dfe108"><a href="https://deviceplus.jp/mc-general/tidbits-of-electronics-01/">ここが分かると面白くなる！エレクトロニクスの豆知識 第1回：はじめてのトランジスタ | Device Plus - デバプラ</a></a></h3>
<div class="outline-text-3" id="text-org4dfe108">
<p>
トランジスタのわかりやすい説明。
</p>
</div>
</div>
<div id="outline-container-orgf7dc33b" class="outline-3">
<h3 id="orgf7dc33b"><a href="#orgf7dc33b"><a href="https://burariweb.info/electronic-work/arduino-learning/arduino-lcd-module-display.html">【Arduino入門編⑰】LCDディスプレイに文字を表示させてみる！［前編］[1602 LCDモジュール] | ぶらり＠web走り書き</a></a></h3>
<div class="outline-text-3" id="text-orgf7dc33b">
<p>
LCDディスプレイを使うチュートリアル。
</p>
</div>
</div>
</div>
<div id="outline-container-org0766be0" class="outline-2">
<h2 id="org0766be0"><a href="#org0766be0">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
